
public class InfoPatterns {
	// .*\\s? \\s?.*
	// (0?[1-9]|1[012])[- /.](0?[1-9]|[12][0-9]|3[01])
	String[] date = { ".*\\s?금일\\((0?[1-9]|1[012])[- /.](0?[1-9]|[12][0-9]|3[01])\\)\\s?.*", // 금일(xx.xx)
			".*\\s?(0?[1-9]|1[012])월[ ]?(0?[1-9]|[12][0-9]|3[01])일\\s?.*", // x월x일
			".*\\s?(0?[1-9]|1[012])월\\s?.*", // x월
			".*\\s?(0?[1-9]|[12][0-9]|3[01])일\\s?.*", // x일
			".*\\s?((19|20)?[0-9]{2})[- /.](0?[1-9]|1[012])[- /.](0?[1-9]|[12][0-9]|3[01])[- /.]\\s?.*" };

	int[][] datePos = { { 0, 1, 1}, { 0, 1, 1 }, { 0, 1, 0 }, { 1, 1, 1 } };

	String[] time = { ".*\\s?([01][0-9]|2[0-3]):([0-5][0-9])\\s?.*", // xx:xx
			".*\\s?(오전|오후)[ ]?(0?[1-9]|[1][012])시[경]?[ ]?\\s?.*", // 오전
																						// x시
			".*\\s?(오전|오후)[ ]?(0?[1-9]|[1][012])시[경]?[ ]?(0?[1-9]|[12345][0-9])분?\\s?.*", // 오전
			// x시
			// x분
			".*\\s?(오전|오후)[ ]?\\s?.*", // 오전,오후 
			".*\\s?([0-9])시[ ]?([0-5][0-9]분)?\\s?.*", // x시 x분
			".*\\s?(0[0-9]|1[0-9]|2[0-3])시[ ]?([0-5][0-9]분)?\\s?.*" // xx시 x분
	};
	
	int[][] timePos = {{0,1,1}, {12,1,0},{12,1,1}, {12,0,0}, {0, 1, 1}, {0,1, 1}};
	
	String[] trainNum = {".*\\s?([1-9])호선\\s?.*" // x호선 				
	};
	
	//추출후  @역 패턴 추가적으로 검사해야함.
	String[] StationDirection = {".*\\s(\\S*)역 (외선|내선)\\s?.*", //@역 외선/내선  
								".*\\s(\\S*)역에서 (\\S*)[역]?방향\\s?.*", //@역에서 @(역)방향
								".*\\s(\\S*) 하선 (\\S*)행\\s?.*", //@역 하선 @행
								".*\\s(\\S*)[ ]?[~|-][ ]?(\\S*)간\\s?.*", //@(역)~@(역)간
								".*\\s(\\S*)[ ]?-[ ]?(\\S*)\\s?.*", //@(역)-@(역)간
								".*\\s(\\S*) 출발 (\\S*) 도착\\s?.*", //@역 출발 @역 도착
								".*\\s(\\S*)역에서()\\s?.*" //@역에서 
								};
	public InfoPatterns() {
	};

	public String[] getStnDirPattern(){
		return StationDirection;
	}
	
	public String[] getDatePattern() {
		return date;
	}

	public int[] getDatePosition(int i) {
		return datePos[i];
	}

	public String[] getTimePattern() {
		return time;
	}
	
	public int[] getTimePosition(int i) {
		return timePos[i];
	}
	
//	public String getTrainNumPattern(){
//	//	return trainNum;
//	}
}
